espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
/***************************************************************************//**
 * @file
 * @brief USB protocol stack library API for EFM32/EZR32.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.  This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "em_device.h"
#if defined(USB_PRESENT) && (USB_COUNT == 1)
#include "em_usb.h"
#if defined(USB_HOST)

#include "em_cmu.h"
#include "em_core.h"
#include "em_usbtypes.h"
#include "em_usbhal.h"
#include "em_usbh.h"
#if (USB_VBUSOVRCUR_PORT != USB_VBUSOVRCUR_PORT_NONE)
#include "em_gpio.h"
#endif

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

USBH_Hc_TypeDef                   hcs[NUM_HC_USED + 2];
int                               USBH_attachRetryCount;
USBH_Init_TypeDef                 USBH_initData;
volatile USBH_PortState_TypeDef   USBH_portStatus;
const USBH_AttachTiming_TypeDef   USBH_attachTiming[] =
{
  /* debounceTime resetTime */
  {  200, 75  },
  {  200, 100 },
  {  200, 50  },
};

#define PORT_VBUS_DELAY       250
#define DEFAULT_CTRL_TIMEOUT  1000

static void Timeout(int hcnum);

#if defined(__ICCARM__)
#pragma diag_suppress=Pe175
#endif

static void Timeout0(void)
{
  Timeout(0);
}
static void Timeout1(void)
{
  Timeout(1);
}
static void Timeout2(void)
{
  Timeout(2);
}
static void Timeout3(void)
{
  Timeout(3);
}
static void Timeout4(void)
{
  Timeout(4);
}
static void Timeout5(void)
{
  Timeout(5);
}
static void Timeout6(void)
{
  Timeout(6);
}
static void Timeout7(void)
{
  Timeout(7);
}
static void Timeout8(void)
{
  Timeout(8);
}
static void Timeout9(void)
{
  Timeout(9);
}
static void Timeout10(void)
{
  Timeout(10);
}
static void Timeout11(void)
{
  Timeout(11);
}
static void Timeout12(void)
{
  Timeout(12);
}
static void Timeout13(void)
{
  Timeout(13);
}

#if defined(__ICCARM__)
#pragma diag_default=Pe175
#endif

static const USBTIMER_Callback_TypeDef hcTimeoutFunc[MAX_NUM_HOSTCHANNELS] =
{
  Timeout0, Timeout1, Timeout2, Timeout3, Timeout4, Timeout5,
  Timeout6, Timeout7, Timeout8, Timeout9, Timeout10, Timeout11,
  Timeout12, Timeout13
};

static void Timeout(int hcnum)
{
  uint32_t hcchar;
  USBH_Hc_TypeDef *hc;
  USBH_Ep_TypeDef *ep;

#if defined(__GNUC__)
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Warray-bounds"
#endif

  hc = &hcs[hcnum];

#if defined(__GNUC__)
#pragma GCC diagnostic pop
#endif

  hcchar = USBHHAL_GetHcChar(hcnum);
  ep = hc->ep;

  if ( ep->type != USB_EPTYPE_INTR ) {
    USBHHAL_HCHalt(hcnum, hcchar);
    hc->status |= HCS_TIMEOUT;
    ep->timeout = 0;
    if ( !hc->idle ) {
      USBHEP_TransferDone(hc->ep, USB_STATUS_TIMEOUT);
    }
  } else {
    if ( !ep->timeout ) {
      /* Restart the channel */
      USBHHAL_HCStart(hcnum);
      USBTIMER_Start(hcnum + HOSTCH_TIMER_INDEX,
                     ep->epDesc.bInterval, hcTimeoutFunc[hcnum]);
    } else {
      ep->timeout -= SL_MIN(ep->timeout, ep->epDesc.bInterval);
      if ( ep->timeout ) {
        /* Restart the channel */
        USBHHAL_HCStart(hcnum);
        USBTIMER_Start(hcnum + HOSTCH_TIMER_INDEX,
                       SL_MIN(ep->timeout, ep->epDesc.bInterval),
                       hcTimeoutFunc[hcnum]);
      } else {
        USBHHAL_HCHalt(hcnum, hcchar);
        hc->status |= HCS_TIMEOUT;
        if ( !hc->idle ) {
          USBHEP_TransferDone(hc->ep, USB_STATUS_TIMEOUT);
        }
      }
    }
  }
}

/** @endcond */

/***************************************************************************//**
 * @brief
 *   Assign a host channel to a given endpoint.
 *
 * @details
 *   After assigning a host channel to an endpoint, all subsequent transfers
 *   to the endpoint will use the given host channel. Several endpoints can
 *   be assigned to the same host channel, but keep in mind that concurrent
 *   transfers can only be performed on endpoints assigned to different host
 *   channels.  @n The default endpoint (EP0) is assigned to host channels 0
 *   and 1 by the host stack.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @param[in] hcnum
 *   Host channel number (0..).
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_AssignHostChannel(USBH_Ep_TypeDef *ep, uint8_t hcnum)
{
  ep->type        = ep->epDesc.bmAttributes & CONFIG_DESC_BM_TRANSFERTYPE;
  ep->in          = (ep->epDesc.bEndpointAddress & USB_SETUP_DIR_MASK) != 0;
  ep->packetSize  = ep->epDesc.wMaxPacketSize;
  ep->addr        = ep->epDesc.bEndpointAddress;
  ep->state       = H_EP_IDLE;

  if ( ep == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_AssignHostChannel(),"
                       " ep NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( hcnum >= MAX_NUM_HOSTCHANNELS ) {
    DEBUG_USB_API_PUTS("\nUSBH_AssignHostChannel(),"
                       " Illegal host channel number");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( ep->in ) {
    ep->hcIn  = hcnum;
  } else {
    ep->hcOut = hcnum;
  }

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Send a SETUP command to a device, non-blocking version.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is non-blocking and returns immediately.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @param[in] bmRequestType
 *   SETUP command request type. A suitable combination of values
 *   @ref USB_SETUP_DIR_D2H, @ref USB_SETUP_DIR_H2D,
 *   @ref USB_SETUP_TYPE_STANDARD_MASK, @ref USB_SETUP_TYPE_CLASS_MASK,
 *   @ref USB_SETUP_TYPE_VENDOR_MASK, @ref USB_SETUP_RECIPIENT_DEVICE,
 *   @ref USB_SETUP_RECIPIENT_INTERFACE, @ref USB_SETUP_RECIPIENT_ENDPOINT or
 *   @ref USB_SETUP_RECIPIENT_OTHER.@n Refer to the USB specification for details.
 *
 * @param[in] bRequest
 *   A specific SETUP command request.
 *
 * @param[in] wValue
 *   Word sized field that varies according to request.
 *
 * @param[in] wIndex
 *   Word sized field that varies according to request. Typically used to pass
 *   an index or offset.
 *
 * @param[in] wLength
 *   Number of bytes to transfer if there is a data stage.
 *
 * @param[in] data
 *   Pointer to transfer data buffer.
 *
 * @param[in] timeout
 *   Transfer timeout in milliseconds. The transfer will be terminated if not
 *   completed within @em timeout milliseconds. A value of 0 means
 *   infinite.
 *
 * @param[in] callback
 *   Function to be called on transfer completion. Supply NULL if no callback
 *   is needed. See @ref USB_XferCompleteCb_TypeDef.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_ControlMsg(USBH_Ep_TypeDef *ep,
                    uint8_t bmRequestType,
                    uint8_t bRequest,
                    uint16_t wValue,
                    uint16_t wIndex,
                    uint16_t wLength,
                    void *data,
                    int timeout,
                    USB_XferCompleteCb_TypeDef callback)
{
  CORE_DECLARE_IRQ_STATE;

  if ( ep == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_ControlMsg(), ep NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  if ( !USBH_DeviceConnected() ) {
    DEBUG_USB_API_PUTS("\nUSBH_ControlMsg(), No device connected");
    return USB_STATUS_ILLEGAL;
  }

