espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
  if ( (uint32_t)data & 3 ) {
    DEBUG_USB_API_PUTS("\nUSBH_ControlMsg(), Misaligned data buffer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  CORE_ENTER_ATOMIC();
  if ( ep->state != H_EP_IDLE ) {
    CORE_EXIT_ATOMIC();
    DEBUG_USB_API_PUTS("\nUSBH_ControlMsg(), Endpoint is busy");
    return USB_STATUS_EP_BUSY;
  }

  if ( !hcs[ep->hcIn].idle || !hcs[ep->hcOut].idle ) {
    CORE_EXIT_ATOMIC();
    DEBUG_USB_API_PUTS("\nUSBH_ControlMsg(), Host channel is busy");
    return USB_STATUS_HC_BUSY;
  }

  ep->setup.bmRequestType = bmRequestType;
  ep->setup.bRequest      = bRequest;
  ep->setup.wValue        = wValue;
  ep->setup.wIndex        = wIndex;
  ep->setup.wLength       = wLength;

  ep->xferCompleted  = false;
  ep->state          = H_EP_SETUP;
  ep->xferCompleteCb = callback;
  ep->buf            = data;
  ep->xferred        = 0;
  ep->timeout        = timeout;
  ep->setupErrCnt    = 0;

  if ( timeout ) {
    USBTIMER_Start(ep->hcOut + HOSTCH_TIMER_INDEX,
                   timeout, hcTimeoutFunc[ep->hcOut]);
  }

  USBH_CtlSendSetup(ep);
  CORE_EXIT_ATOMIC();
  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Send a SETUP command to a device, blocking version.
 *
 * @note
 *   The transfer buffer length must be a multiple of 4 bytes in length and
 *   WORD (4 byte) aligned. When allocating the buffer, round buffer length up.
 *   If it is possible that the host will send more data than your device
 *   expects, round buffer size up to the next multiple of maxpacket size.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out or failed.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @param[in] bmRequestType
 *   SETUP command request type. A suitable combination of values
 *   @ref USB_SETUP_DIR_D2H, @ref USB_SETUP_DIR_H2D,
 *   @ref USB_SETUP_TYPE_STANDARD_MASK, @ref USB_SETUP_TYPE_CLASS_MASK,
 *   @ref USB_SETUP_TYPE_VENDOR_MASK, @ref USB_SETUP_RECIPIENT_DEVICE,
 *   @ref USB_SETUP_RECIPIENT_INTERFACE, @ref USB_SETUP_RECIPIENT_ENDPOINT or
 *   @ref USB_SETUP_RECIPIENT_OTHER.@n Refer to the USB specification for details.
 *
 * @param[in] bRequest
 *   A specific SETUP command request.
 *
 * @param[in] wValue
 *   Word sized field that varies according to request.
 *
 * @param[in] wIndex
 *   Word sized field that varies according to request. Typically used to pass
 *   an index or offset.
 *
 * @param[in] wLength
 *   Number of bytes to transfer if there is a data stage.
 *
 * @param[in] data
 *   Pointer to transfer data buffer.
 *
 * @param[in] timeout
 *   Transfer timeout in milliseconds. The transfer will be terminated if not
 *   completed within @em timeout milliseconds. A value of 0 means
 *   infinite.
 *
 * @return
 *   A positive (or zero) value indicates number of bytes transferred.
 *   @n A negative value indicates a transfer error code enumerated in
 *   @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_ControlMsgB(USBH_Ep_TypeDef *ep,
                     uint8_t bmRequestType,
                     uint8_t bRequest,
                     uint16_t wValue,
                     uint16_t wIndex,
                     uint16_t wLength,
                     void *data,
                     int timeout)
{
  int retVal;

  if ( CORE_IRQ_DISABLED() || CORE_IN_IRQ_CONTEXT() ) {
    DEBUG_USB_API_PUTS("\nUSBH_ControlMsgB() called with int's disabled");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  retVal = USBH_ControlMsg(ep,
                           bmRequestType,
                           bRequest,
                           wValue,
                           wIndex,
                           wLength,
                           data,
                           timeout,
                           NULL);

  if ( retVal == USB_STATUS_OK ) {
    while ( !ep->xferCompleted ) ;

    if ( (retVal = ep->xferStatus) == USB_STATUS_OK ) {
      retVal = ep->xferred;
    }
  }

  return retVal;
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

USB_Status_TypeDef USBH_CtlReceiveData(USBH_Ep_TypeDef *ep, uint16_t length)
{
  USBH_Hc_TypeDef *hc;

  ep->in = true;
  ep->toggle = USB_PID_DATA1;
  ep->remaining = length;

  hc = &hcs[ep->hcIn];
  hc->buf = ep->buf;
  hc->xferred = 0;
  hc->remaining = length;

  USBHHAL_HCStart(ep->hcIn);

  return USB_STATUS_OK;
}

#if defined(USB_RAW_API)
int USBH_CtlRxRaw(uint8_t pid, USBH_Ep_TypeDef *ep, void *data, int byteCount)
{
  uint16_t  packets, len;
  int       hcnum, retval;
  uint32_t  hcchar, status;
  CORE_DECLARE_IRQ_STATE;

  hcnum = ep->hcIn;
  if ( byteCount > 0 ) {
    packets = (byteCount + ep->packetSize - 1) / ep->packetSize;
  } else {
    packets = 1;
  }
  len = packets * ep->packetSize;

  CORE_ENTER_ATOMIC();

  USB->HC[hcnum].INTMSK = USB_HC_INT_STALL | USB_HC_INT_NAK | USB_HC_INT_ACK;
  USB->HC[hcnum].INT = 0xFFFFFFFF;        /* Clear all interrupt flags      */
  NVIC_ClearPendingIRQ(USB_IRQn);
  USB->HAINTMSK |= 1 << hcnum;            /* Enable host channel interrupt  */
  USB->HC[hcnum].CHAR =                   /* Program HCCHAR register        */
                        (ep->parentDevice->addr       <<  _USB_HC_CHAR_DEVADDR_SHIFT)
                        | ((ep->addr & USB_EPNUM_MASK) << _USB_HC_CHAR_EPNUM_SHIFT)
                        | (ep->type                   <<  _USB_HC_CHAR_EPTYPE_SHIFT)
                        | (ep->packetSize             <<  _USB_HC_CHAR_MPS_SHIFT)
                        | (USB_HC_CHAR_EPDIR)
                        | (ep->parentDevice->speed
                           == (HPRT_L_SPEED >> _USB_HPRT_PRTSPD_SHIFT)
                           ? USB_HC_CHAR_LSPDDEV : 0);
  USB->HC[hcnum].TSIZ =
    ((len << _USB_HC_TSIZ_XFERSIZE_SHIFT) & _USB_HC_TSIZ_XFERSIZE_MASK)
    | ((packets << _USB_HC_TSIZ_PKTCNT_SHIFT) & _USB_HC_TSIZ_PKTCNT_MASK)
    | ((pid << _USB_HC_TSIZ_PID_SHIFT) & _USB_HC_TSIZ_PID_MASK);
  USB->HC[hcnum].DMAADDR = (uint32_t)data;
  hcchar = (USB->HC[hcnum].CHAR & ~USB_HC_CHAR_CHDIS) | USB_HC_CHAR_CHENA;
  USB->HC[hcnum].CHAR = hcchar;

  /* Start polling for interrupt */
  retval = USB_STATUS_EP_ERROR;
  while ( (USBHAL_GetCoreInts() & USB_GINTSTS_HCHINT) == 0 ) {
  }
  if ( USBHHAL_GetHostChannelInts() & (1 << hcnum) ) {
    status = USBHHAL_GetHcInts(hcnum);
    hcchar |= USB_HC_CHAR_CHDIS;
    USB->HC[hcnum].CHAR = hcchar;
    USB->HC[hcnum].INTMSK = 0;
    USB->HC[hcnum].INT = 0xFFFFFFFF;

    if ( status & USB_HC_INT_STALL ) {
      retval = USB_STATUS_EP_STALLED;
    } else if ( status & USB_HC_INT_NAK ) {
      retval = USB_STATUS_EP_NAK;
    } else if ( status & USB_HC_INT_ACK ) {
      retval = USB_STATUS_OK;
    }
  }

  NVIC_ClearPendingIRQ(USB_IRQn);
  CORE_EXIT_ATOMIC();
  return retval;
}
#endif

USB_Status_TypeDef USBH_CtlSendData(USBH_Ep_TypeDef *ep, uint16_t length)
{
  USBH_Hc_TypeDef *hc;

