espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
  CMU->HFBUSCLKEN0 |= CMU_HFBUSCLKEN0_USB;
  CMU->USBCTRL     |= CMU_USBCTRL_USBCLKEN;
#endif

  /* Enable USB interrupt. */
  NVIC_ClearPendingIRQ(USB_IRQn);
  NVIC_EnableIRQ(USB_IRQn);

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Populate device and endpoint data structures with data retrieved during
 *   device enumeration.
 *
 * @details
 *   Use this function prior to moving a device out of default state.
 *   The application itself must allocate device and endpoint structures.
 *   Data from a prior call to @ref USBH_QueryDeviceB() must be passed in input
 *   parameter @em buf. The device speed can be determined with
 *   @ref USBH_GetPortSpeed() for devices directly attached to the USB port.
 *   Devices attached via a hub must retrieve this information by querying the
 *   hub.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @param[in] ep
 *   Pointer to an array of @ref USBH_Ep_TypeDef endpoint data structures.
 *
 * @param[in] numEp
 *   Number of elements in endpoint array.
 *
 * @param[in] deviceSpeed
 *   @ref PORT_FULL_SPEED or @ref PORT_LOW_SPEED.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_InitDeviceData(USBH_Device_TypeDef *device,
                        const uint8_t *buf,
                        USBH_Ep_TypeDef *ep,
                        int numEp,
                        uint8_t deviceSpeed)
{
  int i;

  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_InitDeviceData(), device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  memset(device, 0, sizeof(USBH_Device_TypeDef) );

  device->ep = ep;
  device->addr = 0;
  device->numEp = numEp;
  device->speed = deviceSpeed;

  device->ep0.packetSize = 8;
  if ( buf ) {    /* Copy EP0 data from buffer filled by USBH_QueryDevice() */
    memcpy(&device->ep0,
           &((USBH_Device_TypeDef*)buf)->ep0, sizeof(USBH_Ep_TypeDef) );
  }
  device->ep0.parentDevice = device;
  device->ep0.type = USB_EPTYPE_CTRL;
  device->ep0.hcOut = 0;
  device->ep0.hcIn = 1;

  if ( ep ) {
    for ( i = 0; i < numEp; i++ ) {
      memset(&device->ep[i], 0, sizeof(USBH_Ep_TypeDef) );
      device->ep[i].parentDevice = device;
      device->ep[i].toggle = USB_PID_DATA0;
    }
  }

  if ( buf ) {/* Copy descriptor data from buffer filled by USBH_QueryDevice() */
    memcpy(&device->devDesc,
           &((USBH_Device_TypeDef*)buf)->devDesc, USB_DEVICE_DESCSIZE);
    memcpy(&device->confDesc,
           &((USBH_Device_TypeDef*)buf)->confDesc, USB_CONFIG_DESCSIZE);
    memcpy(&device->itfDesc,
           USBH_QGetInterfaceDescriptor(buf, 0, 0), USB_INTERFACE_DESCSIZE);

    if ( ep ) {
      for ( i = 0; i < numEp; i++ ) {
        memcpy(&device->ep[i].epDesc,
               USBH_QGetEndpointDescriptor(buf, 0, 0, i),
               USB_ENDPOINT_DESCSIZE);
      }
    }
  }

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Drive reset signalling on the USB port.
 *
 * @note
 *   This function is primarily meant for debugging a device.
 *   When returning the device will appear to be disconnected.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PortReset(void)
{
  if ( CORE_IRQ_DISABLED() || CORE_IN_IRQ_CONTEXT() ) {
    DEBUG_USB_API_PUTS("\nUSBH_PortReset() called with int's disabled");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USBH_portStatus = H_PORT_CONNECTED_RESETTING;
  CORE_ATOMIC_SECTION(
    USBHHAL_PortReset(true);
    )

  USBTIMER_DelayMs(50);                   /* USB Reset delay */

  CORE_ATOMIC_SECTION(
    USBHHAL_PortReset(false);
    )

  USBTIMER_DelayMs(100);                  /* Reset recovery time */
  USBH_portStatus = H_PORT_DISCONNECTED;
  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Drive resume signalling on the USB port.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PortResume(void)
{
  if ( CORE_IRQ_DISABLED() || CORE_IN_IRQ_CONTEXT() ) {
    DEBUG_USB_API_PUTS("\nUSBH_PortResume() called with int's disabled");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  CORE_ATOMIC_SECTION(
    USBHHAL_PortResume(true);
    )

  USBTIMER_DelayMs(30);

  CORE_ATOMIC_SECTION(
    USBHHAL_PortResume(false);
    )

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Set the USB port in suspend mode.
 ******************************************************************************/
void USBH_PortSuspend(void)
{
  CORE_ATOMIC_SECTION(
    USBHHAL_PortSuspend();
    )
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

int USBH_PortVbusOn(bool on)
{
  if ( CORE_IRQ_DISABLED() || CORE_IN_IRQ_CONTEXT() ) {
    DEBUG_USB_API_PUTS("\nUSBH_PortVbusOn() called with int's disabled");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  CORE_ATOMIC_SECTION(
    USBHHAL_VbusOn(on);

    if ( !on ) {
    USBH_portStatus = H_PORT_DISCONNECTED;
  }
    )

  USBTIMER_DelayMs(PORT_VBUS_DELAY);
  return USB_STATUS_OK;
}

/** @endcond */

#if defined(USB_USE_PRINTF)
/***************************************************************************//**
 * @brief
 *   Pretty print a configuration descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when \#define USB_USE_PRINTF and
 *   \#define USER_PUTCHAR macros are properly defined when configuring the
 *   protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] config
 *   Pointer to a @ref USB_ConfigurationDescriptor_TypeDef data structure.
 *
 * @param[in] maxLen
 *   The size of the data buffer passed as input parameter @em config.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PrintConfigurationDescriptor(
  const USB_ConfigurationDescriptor_TypeDef *config,
  int maxLen)
{
  char *c;
  int remaining;

  if ( config == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_PrintConfigurationDescriptor(),"
                       " config NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USB_PRINTF("\n\nConfiguration descriptor:");
  USB_PRINTF("\n bLength              %d", config->bLength);
  USB_PRINTF("\n bDescriptorType      0x%02X", config->bDescriptorType);
  USB_PRINTF("\n wTotalLength         %d", config->wTotalLength);
  USB_PRINTF("\n bNumInterfaces       %d", config->bNumInterfaces);
  USB_PRINTF("\n bConfigurationValue  %d", config->bConfigurationValue);
  USB_PRINTF("\n iConfiguration       %d", config->iConfiguration);
  USB_PRINTF("\n bmAttributes         0x%02X", config->bmAttributes);
  USB_PRINTF("\n bMaxPower            %d\n", config->bMaxPower);

  maxLen -= config->bLength;
  if ( maxLen > 0 ) {
    remaining = SL_MIN(config->wTotalLength - config->bLength, maxLen);
    if ( remaining > 0 ) {
      USB_PUTCHAR('\n');
      c = (char*)(config + 1);
      while ( remaining-- ) {
        USB_PRINTF("0x%02X ", *c++);
      }
      USB_PUTCHAR('\n');
    }
  }

