espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Pretty print a device descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when \#define USB_USE_PRINTF and
 *   \#define USER_PUTCHAR macros are properly defined when configuring the
 *   protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] device
 *   Pointer to a @ref USB_DeviceDescriptor_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PrintDeviceDescriptor(const USB_DeviceDescriptor_TypeDef *device)
{
  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_PrintDeviceDescriptor(),"
                       " device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USB_PRINTF("\n\nDevice descriptor:");
  USB_PRINTF("\n bLength              %d", device->bLength);
  USB_PRINTF("\n bDescriptorType      0x%02X", device->bDescriptorType);
  USB_PRINTF("\n bcdUSB               0x%04X", device->bcdUSB);
  USB_PRINTF("\n bDeviceClass         %d", device->bDeviceClass);
  USB_PRINTF("\n bDeviceSubClass      %d", device->bDeviceSubClass);
  USB_PRINTF("\n bDeviceProtocol      %d", device->bDeviceProtocol);
  USB_PRINTF("\n bMaxPacketSize       %d", device->bMaxPacketSize0);
  USB_PRINTF("\n idVendor             0x%04X", device->idVendor);
  USB_PRINTF("\n idProduct            0x%04X", device->idProduct);
  USB_PRINTF("\n bcdDevice            0x%04X", device->bcdDevice);
  USB_PRINTF("\n iManufacturer        %d", device->iManufacturer);
  USB_PRINTF("\n iProduct             %d", device->iProduct);
  USB_PRINTF("\n iSerialNumber        %d", device->iSerialNumber);
  USB_PRINTF("\n bNumConfigurations   %d\n", device->bNumConfigurations);

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Pretty print an endpoint descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when \#define USB_USE_PRINTF and
 *   \#define USER_PUTCHAR macros are properly defined when configuring the
 *   protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] endpoint
 *   Pointer to a @ref USB_EndpointDescriptor_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PrintEndpointDescriptor(
  const USB_EndpointDescriptor_TypeDef *endpoint)
{
  if ( endpoint == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_PrintEndpointDescriptor(),"
                       " endpoint NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USB_PRINTF("\n\nEndpoint descriptor:");
  USB_PRINTF("\n bLength              %d", endpoint->bLength);
  USB_PRINTF("\n bDescriptorType      0x%02X", endpoint->bDescriptorType);
  USB_PRINTF("\n bEndpointAddress     0x%02X", endpoint->bEndpointAddress);
  USB_PRINTF("\n bmAttributes         0x%02X", endpoint->bmAttributes);
  USB_PRINTF("\n wMaxPacketSize       %d", endpoint->wMaxPacketSize);
  USB_PRINTF("\n bInterval            %d\n", endpoint->bInterval);

  return USB_STATUS_OK;
}

/***************************************************************************//**
 * @brief
 *   Pretty print an interface descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when \#define USB_USE_PRINTF and
 *   \#define USER_PUTCHAR macros are properly defined when configuring the
 *   protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] interface
 *   Pointer to a @ref USB_InterfaceDescriptor_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_PrintInterfaceDescriptor(
  const USB_InterfaceDescriptor_TypeDef *interface)
{
  if ( interface == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_PrintInterfaceDescriptor(),"
                       " interface NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  USB_PRINTF("\n\nInterface descriptor:");
  USB_PRINTF("\n bLength              %d", interface->bLength);
  USB_PRINTF("\n bDescriptorType      0x%02X", interface->bDescriptorType);
  USB_PRINTF("\n bInterfaceNumber     %d", interface->bInterfaceNumber);
  USB_PRINTF("\n bAlternateSetting    %d", interface->bAlternateSetting);
  USB_PRINTF("\n bNumEndpoints        %d", interface->bNumEndpoints);
  USB_PRINTF("\n bInterfaceClass      0x%02X", interface->bInterfaceClass);
  USB_PRINTF("\n bInterfaceSubClass   0x%02X", interface->bInterfaceSubClass);
  USB_PRINTF("\n bInterfaceProtocol   0x%02X", interface->bInterfaceProtocol);
  USB_PRINTF("\n iInterface           %d\n", interface->iInterface);

  return USB_STATUS_OK;
}
#endif /* defined( USB_USE_PRINTF ) */

#if defined(__ICCARM__)
#pragma diag_suppress=Pa039
#endif
/***************************************************************************//**
 * @brief
 *   Print a USB string descriptor on the debug serial port.
 *
 * @note
 *   This function is enabled when the \#define USER_PUTCHAR macro is properly
 *   defined when configuring the protocol stack in "usbconfig.h".
 *   The function is primarily meant for debugging purposes.
 *
 * @param[in] pre
 *   Optional text string to prepend to the string descriptor. Pass NULL if
 *   not needed.
 *
 * @param[in] s
 *   Pointer to a @ref USB_StringDescriptor_TypeDef data structure.
 *
 * @param[in] post
 *   Optional text string to append to the string descriptor. Pass NULL if
 *   not needed.
 ******************************************************************************/
void USBH_PrintString(const char *pre,
                      const USB_StringDescriptor_TypeDef *s,
                      const char *post)
{
  char *c;

  if ( pre ) {
    USB_PUTS(pre);
  }

  if ( s ) {
    c = (char*)&s->name;
    while ( *c ) {
      USB_PUTCHAR(*c);
      c += 2;
    }
  }

  if ( post ) {
    USB_PUTS(post);
  }
}
#if defined(__ICCARM__)
#pragma diag_default=Pa039
#endif

