espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
/*
 * A request for a configuration descriptor returns the configuration
 * descriptor, all interface descriptors, and endpoint descriptors for all
 * of the interfaces in a single request.
 * The first interface descriptor follows the configuration descriptor.
 * The endpoint descriptors for the first interface follow the first interface
 * descriptor.
 * If there are additional interfaces, their interface descriptor and endpoint
 * descriptors follow the first interface's endpoint descriptors.
 * Class-specific and/or vendor-specific descriptors follow the standard
 * descriptors they extend or modify.
 */

/***************************************************************************//**
 * @brief
 *   Return a pointer to a configuration descriptor.
 *
 * @note
 *   This function search through @em buf looking for a given configuration
 *   descriptor.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @param[in] configIndex
 *   Configuration index, a zero based number indicating which configuration
 *   descriptor to find.
 *
 * @return
 *   A pointer to @ref USB_ConfigurationDescriptor_TypeDef. NULL if no
 *   descriptor found.
 ******************************************************************************/
USB_ConfigurationDescriptor_TypeDef *USBH_QGetConfigurationDescriptor(
  const uint8_t *buf, int configIndex)
{
  int i;
  const uint8_t *start, *end;
  USB_DeviceDescriptor_TypeDef *dev;

  dev = USBH_QGetDeviceDescriptor(buf);
  if ( dev ) {
    if ( configIndex < dev->bNumConfigurations ) {
      /* Start of first configuration descriptor */
      start = buf + sizeof(USBH_Device_TypeDef);

      /* Find end of avaiable data, NOTE: ep contains end of buf ! */
      end = SL_MIN(
        start + ((USB_ConfigurationDescriptor_TypeDef*)start)->wTotalLength,
        (uint8_t*)(((USBH_Device_TypeDef*)buf)->ep));

      /* Scan through, looking for correct configuration descriptor */
      i = 0;
      while ( start < end ) {
        if ( *start == 0 ) {
          return NULL;
        }

        if ( (*start          == USB_CONFIG_DESCSIZE)
             && (*(start + 1) == USB_CONFIG_DESCRIPTOR)) {
          if ( i == configIndex ) {
            return (USB_ConfigurationDescriptor_TypeDef*)start;
          }
          i++;
        }

        start += *start;
      }
    }
  }
  return NULL;
}

/***************************************************************************//**
 * @brief
 *   Return a pointer to the device descriptor.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @return
 *   A pointer to @ref USB_DeviceDescriptor_TypeDef. NULL if no
 *   descriptor found.
 ******************************************************************************/
USB_DeviceDescriptor_TypeDef *USBH_QGetDeviceDescriptor(const uint8_t *buf)
{
  USB_DeviceDescriptor_TypeDef *dev = &((USBH_Device_TypeDef*)buf)->devDesc;

  if ( buf == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_QGetDeviceDescriptor(), buf NULL pointer");
    EFM_ASSERT(false);
    return NULL;
  }

  if ( (dev->bLength            == USB_DEVICE_DESCSIZE)
       && (dev->bDescriptorType == USB_DEVICE_DESCRIPTOR)) {
    return dev;
  }
  return NULL;
}

/***************************************************************************//**
 * @brief
 *   Return a pointer to an endpoint descriptor.
 *
 * @note
 *   This function search through @em buf looking for a given endpoint
 *   descriptor.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @param[in] configIndex
 *   Configuration index, a zero based number indicating in which configuration
 *   descriptor to look for the interface containing the endpoint descriptor.
 *
 * @param[in] interfaceIndex
 *   Interface index, a zero based number indicating the interface
 *   descriptor to look for the correct endpoint descriptor in.
 *
 * @param[in] endpointIndex
 *   Endpoint index, a zero based number indicating which endpoint
 *   descriptor to look for.
 *
 * @return
 *   A pointer to @ref USB_EndpointDescriptor_TypeDef. NULL if no
 *   descriptor found.
 ******************************************************************************/
USB_EndpointDescriptor_TypeDef *USBH_QGetEndpointDescriptor(
  const uint8_t *buf, int configIndex, int interfaceIndex, int endpointIndex)
{
  int i;
  uint8_t *start, *end;
  USB_InterfaceDescriptor_TypeDef *itf;

  itf = USBH_QGetInterfaceDescriptor(buf, configIndex, interfaceIndex);
  if ( itf ) {
    if ( endpointIndex < itf->bNumEndpoints ) {
      /* First possible endpoint descriptor */
      start = (uint8_t*)itf + USB_INTERFACE_DESCSIZE;

      /* Search until start of next interface decsriptor, or to end of buf */
      end = (uint8_t*)USBH_QGetInterfaceDescriptor(
        buf, configIndex, interfaceIndex + 1);
      if ( end == NULL ) {
        /* NOTE: ep contains end of buf ! */
        end = (uint8_t*)((USBH_Device_TypeDef*)buf)->ep;
      }

      /* Scan through, looking for correct endpoint descriptor */
      i = 0;
      while ( start < end ) {
        if ( *start == 0 ) {
          return NULL;
        }

        if ( (*start          == USB_ENDPOINT_DESCSIZE)
             && (*(start + 1) == USB_ENDPOINT_DESCRIPTOR)) {
          if ( i == endpointIndex ) {
            return (USB_EndpointDescriptor_TypeDef*)start;
          }
          i++;
        }

        start += *start;
      }
    }
  }
  return NULL;
}

/***************************************************************************//**
 * @brief
 *   Return a pointer to an interface descriptor.
 *
 * @note
 *   This function search through @em buf looking for a given interface
 *   descriptor.
 *
 * @param[in] buf
 *   A data buffer containing enumeration data retrieved with
 *   @ref USBH_QueryDeviceB().
 *
 * @param[in] configIndex
 *   Configuration index, a zero based number indicating in which configuration
 *   descriptor to look for the interface descriptor.
 *
 * @param[in] interfaceIndex
 *   Interface index, a zero based number indicating which interface
 *   descriptor to find.
 *
 * @return
 *   A pointer to @ref USB_InterfaceDescriptor_TypeDef. NULL if no
 *   descriptor found.
 ******************************************************************************/
USB_InterfaceDescriptor_TypeDef *USBH_QGetInterfaceDescriptor(
  const uint8_t *buf, int configIndex, int interfaceIndex)
{
  int i;
  uint8_t *start, *end;
  USB_ConfigurationDescriptor_TypeDef *conf;

  conf = USBH_QGetConfigurationDescriptor(buf, configIndex);
  if ( conf ) {
    if ( interfaceIndex < conf->bNumInterfaces ) {
      /* First interface descriptor */
      start = (uint8_t*)conf + USB_CONFIG_DESCSIZE;

      /* Search until start of next config decsriptor, or to end of buf */
      end = (uint8_t*)USBH_QGetConfigurationDescriptor(buf, configIndex + 1);
      if ( end == NULL ) {
        /* NOTE: ep contains end of buf ! */
        end = (uint8_t*)((USBH_Device_TypeDef*)buf)->ep;
      }

      /* Scan through, looking for correct interface descriptor */
      i = 0;
      while ( start < end ) {
        if ( *start == 0 ) {
          return NULL;
        }

        if ( (*start          == USB_INTERFACE_DESCSIZE)
             && (*(start + 1) == USB_INTERFACE_DESCRIPTOR)) {
          if ( (i == interfaceIndex)
               && (i
                   == ((USB_InterfaceDescriptor_TypeDef*)start)->bInterfaceNumber) ) {
            return (USB_InterfaceDescriptor_TypeDef*)start;
          }
          i++;
        }

        start += *start;
      }
    }
  }
  return NULL;
}

/***************************************************************************//**
 * @brief
 *   Will request both the device descriptor and the entire configuration
 *   descriptor from the device at USB address 0.
 *
 * @details
 *   The device speed can be determined with @ref USBH_GetPortSpeed() for
 *   devices directly attached to the USB port. Devices attached via a hub
 *   must retrieve this information by querying the hub.
 *
 * @note
 *   This function is normally used to retrieve the data needed by
 *   @ref USBH_InitDeviceData().
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] buf
 *   A data buffer with sufficent space for the descriptors. The data buffer
 *   size must be sizeof( @ref USBH_Device_TypeDef ) + the anticipated
 *   maximum size of the entire configuration descriptor.
 *
 * @param[in] bufsize
 *   The size of the data buffer.
 *
 * @param[in] deviceSpeed
 *   @ref PORT_FULL_SPEED or @ref PORT_LOW_SPEED.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_QueryDeviceB(uint8_t *buf, size_t bufsize, uint8_t deviceSpeed)
{
  USBH_Device_TypeDef *device = (USBH_Device_TypeDef*)buf;

  USBH_InitDeviceData(device, NULL, NULL, 0, deviceSpeed);

  device->speed = deviceSpeed;
  device->ep = (USBH_Ep_TypeDef*)(buf + bufsize);/* Save buffer end addr here ! */

  /* Get the first 8 bytes of the device desc to figure out device EP0 size */
  if ( 8 != USBH_GetDeviceDescriptorB(device,
                                      &device->devDesc,
                                      SL_MIN(8U, bufsize) ) ) {
    return USB_STATUS_REQ_ERR;
  }
  device->ep0.packetSize = device->devDesc.bMaxPacketSize0;

  /* Get entire device descriptor */
  if ( USB_DEVICE_DESCSIZE != USBH_GetDeviceDescriptorB(
         device,
         buf + sizeof(USBH_Device_TypeDef),
         SL_MIN( (size_t)USB_DEVICE_DESCSIZE, bufsize) ) ) {
    return USB_STATUS_REQ_ERR;
  }
  memcpy(&device->devDesc,
         buf + sizeof(USBH_Device_TypeDef), USB_DEVICE_DESCSIZE);

