espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
  retVal = USBH_ControlMsgB(
    &device->ep0,
    USB_SETUP_DIR_H2D | USB_SETUP_RECIPIENT_DEVICE
    | USB_SETUP_TYPE_STANDARD_MASK,                       /* bmRequestType */
    SET_ADDRESS,                                          /* bRequest      */
    deviceAddress,                                        /* wValue        */
    0,                                                    /* wIndex        */
    0,                                                    /* wLength       */
    NULL,                                                 /* void* data    */
    DEFAULT_CTRL_TIMEOUT);                                /* int timeout   */

  if ( retVal == USB_STATUS_OK ) {
    device->addr = deviceAddress;
  }
  return retVal;
}

/***************************************************************************//**
 * @brief
 *   Activate a device interface within current device configuration.
 *
 * @note
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] interfaceIndex
 *   The interface index. A zero based value.
 *
 * @param[in] alternateSetting
 *   The alternate interface setting value.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_SetAltInterfaceB(USBH_Device_TypeDef *device,
                          uint8_t interfaceIndex, uint8_t alternateSetting)
{
  int i, retVal;

  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_SetAltInterfaceB(), device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  retVal = USBH_ControlMsgB(
    &device->ep0,
    USB_SETUP_DIR_H2D | USB_SETUP_RECIPIENT_INTERFACE
    | USB_SETUP_TYPE_STANDARD_MASK,                       /* bmRequestType */
    SET_INTERFACE,                                        /* bRequest      */
    alternateSetting,                                     /* wValue        */
    interfaceIndex,                                       /* wIndex        */
    0,                                                    /* wLength       */
    NULL,                                                 /* void* data    */
    DEFAULT_CTRL_TIMEOUT);                                /* int timeout   */

  if ( retVal == USB_STATUS_OK ) {
    // Alternate settings are mutually exclusive within the interface

    // We should:
    // Deactivate ep's in previous alternate interface setting
    // Activate ep's in the new alternate setting of the interface

    for ( i = 0; i < device->numEp; i++ ) {      /* Reset all data toggles */
      device->ep[i].toggle = USB_PID_DATA0;
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief
 *   Activate a device configuration.
 *
 * @note
 *   This command will move the device to the configured state.
 *   @n This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] device
 *   Pointer to a @ref USBH_Device_TypeDef data structure.
 *
 * @param[in] configValue
 *   The configuration value. The value can be retrieved from
 *   device->confDesc.bConfigurationValue
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_SetConfigurationB(USBH_Device_TypeDef *device, uint8_t configValue)
{
  int i, retVal;

  if ( device == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_SetConfigurationB(), device NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  retVal = USBH_ControlMsgB(
    &device->ep0,
    USB_SETUP_DIR_H2D | USB_SETUP_RECIPIENT_DEVICE
    | USB_SETUP_TYPE_STANDARD_MASK,                       /* bmRequestType */
    SET_CONFIGURATION,                                    /* bRequest      */
    configValue,                                          /* wValue        */
    0,                                                    /* wIndex        */
    0,                                                    /* wLength       */
    NULL,                                                 /* void* data    */
    DEFAULT_CTRL_TIMEOUT);                                /* int timeout   */

  if ( retVal == USB_STATUS_OK ) {
    // Configurations are mutually exclusive within the device

    // Should:
    // Deactivate ep's in previous configuration
    // Activate ep's in new configuration

    for ( i = 0; i < device->numEp; i++ ) {      /* Reset all data toggles */
      device->ep[i].toggle = USB_PID_DATA0;
    }
  }

  return retVal;
}

/***************************************************************************//**
 * @brief
 *   Set an endpoint in the stalled (halted) state.
 *
 * @note
 *   This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_StallEpB(USBH_Ep_TypeDef *ep)
{
  if ( ep == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_StallEpB(), ep NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  return USBH_ControlMsgB(&ep->parentDevice->ep0,
                          USB_SETUP_DIR_H2D | USB_SETUP_RECIPIENT_ENDPOINT
                          | USB_SETUP_TYPE_STANDARD_MASK, /* bmRequestType */
                          SET_FEATURE,                    /* bRequest      */
                          USB_FEATURE_ENDPOINT_HALT,      /* wValue        */
                          ep->addr,                       /* wIndex        */
                          0,                              /* wLength       */
                          NULL,                           /* void* data    */
                          DEFAULT_CTRL_TIMEOUT);          /* int timeout   */
}

/***************************************************************************//**
 * @brief
 *   Stop USB host operation.
 *
 * @details
 *   USB host operation is terminated and VBUS on the port is turned off.
 ******************************************************************************/
void USBH_Stop(void)
{
  int i;

