espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
  USBTIMER_Stop(HOSTPORT_TIMER_INDEX);
  for ( i = 0; i < NUM_HC_USED + 2; i++ ) {
    USBTIMER_Stop(i + HOSTCH_TIMER_INDEX);
  }
  CORE_ATOMIC_SECTION(
    USBHAL_DisableGlobalInt();
    )
  USBH_PortVbusOn(false);
  USBHAL_DisablePhyPins();
  /* Turn off USB clocks. */
#if defined(_SILICON_LABS_32B_SERIES_0)
  CMU->HFCORECLKEN0 &= ~(CMU_HFCORECLKEN0_USB | CMU_HFCORECLKEN0_USBC);
#else
  CMU->HFBUSCLKEN0  &= ~CMU_HFBUSCLKEN0_USB;
  CMU->USBCTRL      &= ~CMU_USBCTRL_USBCLKEN;
#endif
}

/***************************************************************************//**
 * @brief
 *   Reset stall state on a stalled (halted) endpoint.
 *
 * @note
 *   This function is blocking and will not return before the transfer
 *   has completed, timed out (1 second) or failed.
 *
 * @param[in] ep
 *   Pointer to a @ref USBH_Ep_TypeDef data structure.
 *
 * @return
 *   @ref USB_STATUS_OK on success, else an appropriate error code enumerated
 *   in @ref USB_Status_TypeDef.
 ******************************************************************************/
int USBH_UnStallEpB(USBH_Ep_TypeDef *ep)
{
  int retVal;

  if ( ep == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_UnStallEpB(), ep NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  retVal = USBH_ControlMsgB(&ep->parentDevice->ep0,
                            USB_SETUP_DIR_H2D | USB_SETUP_RECIPIENT_ENDPOINT
                            | USB_SETUP_TYPE_STANDARD_MASK, /* bmRequestType */
                            CLEAR_FEATURE,                  /* bRequest      */
                            USB_FEATURE_ENDPOINT_HALT,      /* wValue        */
                            ep->addr,                       /* wIndex        */
                            0,                              /* wLength       */
                            NULL,                           /* void* data    */
                            DEFAULT_CTRL_TIMEOUT);          /* int timeout   */

  if ( retVal == USB_STATUS_OK ) {
    ep->toggle = USB_PID_DATA0;
  }

  return retVal;
}

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

static void InitUsb(void)
{
  int i;

  memset(hcs, 0, sizeof(hcs) );
  for ( i = 0; i < NUM_HC_USED + 2; i++ ) {
    hcs[i].idle = true;
  }

  CORE_ATOMIC_SECTION(
    USBHHAL_CoreInit(USBH_initData.rxFifoSize, USBH_initData.nptxFifoSize,
                     USBH_initData.ptxFifoSize);
    NVIC_ClearPendingIRQ(USB_IRQn);
    )
}

/** @endcond */

/***************************************************************************//**
 * @brief
 *   Wait for device connection.
 *
 * @details
 *   This function will wait for device connection and try to read the 8 first
 *   bytes of the device descriptor.
 *   @n First the USB peripheral is initializet (reset) and VBUS is turned on.
 *   When a device is connected, an USB reset will be signalled on the USB port,
 *   and then a USB GetDescriptor command is performed.
 *   @n This procedure is repeated until success or timeout. On each iteration
 *   the duration of USB reset signalling is varied.
 *
 * @param[in] buf
 *   A data buffer with sufficent space for retrieving the first 8 bytes of
 *   a device descriptor. The data buffer size must be
 *   sizeof( @ref USBH_Device_TypeDef ) + 8.
 *
 * @param[in] timeoutInSeconds
 *   Timeout in seconds. A value of 0 means infinite.
 *
 * @return
 *   Returns @ref USB_STATUS_OK on success, @ref USB_STATUS_TIMEOUT on
 *   timeout, @ref USB_STATUS_DEVICE_MALFUNCTION if a device was attached
 *   but USB communications could not be succesfully established with the device,
 *   or @ref USB_STATUS_PORT_OVERCURRENT if a VBUS overcurrent condition exist.
 ******************************************************************************/
int USBH_WaitForDeviceConnectionB(uint8_t *buf, int timeoutInSeconds)
{
  bool xferError;
  USBH_Device_TypeDef *device;
  int accumulatedTime, deadLine;

  if ( buf == NULL ) {
    DEBUG_USB_API_PUTS("\nUSBH_WaitForDeviceConnectionB(),"
                       " buf NULL pointer");
    EFM_ASSERT(false);
    return USB_STATUS_ILLEGAL;
  }

  xferError = false;
  accumulatedTime = 0;
  USBH_attachRetryCount = 0;
  deadLine = timeoutInSeconds * 1000;
  device = (USBH_Device_TypeDef*)buf;

  while ( 1 ) {
    /* If USB is enabled, turn it off. */
    if ( USBHHAL_InitializedAndPowered() ) {
      USBH_PortVbusOn(false);
      if ( deadLine ) {
        accumulatedTime += PORT_VBUS_DELAY;
      }
    }

    /* Reset and init USB core. */
    InitUsb();
    if ( deadLine ) {
      accumulatedTime += 50;
    }

    /* Turn on VBUS. */
    USBH_PortVbusOn(true);
    DEBUG_USB_INT_LO_PUTCHAR('1');
    if ( deadLine ) {
      accumulatedTime += PORT_VBUS_DELAY;
    }

    /* Enable interrupts from USB core. */
    CORE_ATOMIC_SECTION(
      USBHHAL_EnableInts();
      USBHAL_EnableGlobalInt();
      )

    /* Wait for device connection. */
    while ( 1 ) {
      if ( USBH_DeviceConnected() ) {
        break;
      }

      if ( (deadLine)
           && (accumulatedTime >= deadLine)    ) {
        return USB_STATUS_TIMEOUT;
      }

#if (USB_VBUSOVRCUR_PORT != USB_VBUSOVRCUR_PORT_NONE)
      if ( GPIO_PinInGet(USB_VBUSOVRCUR_PORT, USB_VBUSOVRCUR_PIN)
           == USB_VBUSOVRCUR_POLARITY ) {
        DEBUG_USB_INT_LO_PUTCHAR('~');
        USBHHAL_PortReset(false);
        USBHHAL_VbusOn(false);
        USBTIMER_Stop(HOSTPORT_TIMER_INDEX);
        USBH_portStatus = H_PORT_OVERCURRENT;
        return USB_STATUS_PORT_OVERCURRENT;
      }
#endif
      USBTIMER_DelayMs(50);
      if ( deadLine ) {
        accumulatedTime += 50;
      }
    }

    /* Reset recovery time, the USB standard says 10ms. Extend the  */
    /* timeout to be lenient with non compliant devices.            */
    USBTIMER_DelayMs(100);
    if ( deadLine ) {
      accumulatedTime += 100;
    }

    /* Do one USB transfer to check if device connection is OK. */

    USBH_InitDeviceData(device, NULL, NULL, 0, USBH_GetPortSpeed() );

    /* Get the first 8 bytes of the device descriptor */
    if ( 8 == USBH_GetDeviceDescriptorB(device, &device->devDesc, 8) ) {
      return USB_STATUS_OK;
    } else {
      xferError = true;
      if ( deadLine ) {
        accumulatedTime += DEFAULT_CTRL_TIMEOUT;
      }
    }

    /* Disable USB, power down VBUS. */
    USBH_Stop();
    /* Enable USB clocks again, USBH_Stop() turns them off. */
#if defined(_SILICON_LABS_32B_SERIES_0)
    CMU->HFCORECLKEN0 |= CMU_HFCORECLKEN0_USB | CMU_HFCORECLKEN0_USBC;
#else
    CMU->HFBUSCLKEN0  |= CMU_HFBUSCLKEN0_USB;
    CMU->USBCTRL      |= CMU_USBCTRL_USBCLKEN;
#endif

    if ( deadLine ) {
      accumulatedTime += PORT_VBUS_DELAY;
    }

    if ( (deadLine)
         && (accumulatedTime >= deadLine)    ) {
      break;
    }

    USBH_attachRetryCount = (USBH_attachRetryCount + 1)
                            % (sizeof(USBH_attachTiming)
                               / sizeof(USBH_AttachTiming_TypeDef) );
  }

