espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/middleware/usb_gecko/src/em_usbh.c
  @ref USBH_PortReset() @n
    Drive reset signalling on the USB host port.

  @ref USBH_PortResume() @n
    Drive resume signalling on the USB host port.

  @ref USBH_PortSuspend() @n
    Set the USB host port in suspend mode.

 @n @subsection usb_host_enum Enumeration and query functions

  @ref USBH_QueryDeviceB() @n
   This function will read the device and configuration descriptors
   from a device at USB address 0. The application must allocate a buffer
   of sufficent size to hold the data. This data buffer can later be
   used by all USBH_Q<em>xxx</em> functions to retrieve pointers to
   any descriptor within any configuration descriptor. Data retrieved
   by this function must also be passed to @htmlonly USBH_InitDeviceData()
   @endhtmlonly before normal device communication can start.
   Ref. section @ref usb_device_enumeration.

  @ref USBH_QGetConfigurationDescriptor() @n
   Get a pointer to a given configuration descriptor. Parses through a
   data buffer which must have been previously populated by a call to
   @htmlonly USBH_QueryDeviceB(). @endhtmlonly

  @ref USBH_QGetDeviceDescriptor() @n
   Get a pointer to the device descriptor. Parses through a data buffer
   which must have been previously populated by a call to @htmlonly
   USBH_QueryDeviceB(). @endhtmlonly

  @ref USBH_QGetEndpointDescriptor() @n
   Get a pointer to a given endpoint descriptor within a given interface
   within a given configuration. Parses through a data buffer which must
   have been previously populated by a call to @htmlonly USBH_QueryDeviceB().
   @endhtmlonly

  @ref USBH_QGetInterfaceDescriptor() @n
   Get a pointer to an interface descriptor within a given configuration.
   Parses through a data buffer which must have been previously populated
   by a call to @htmlonly USBH_QueryDeviceB(). @endhtmlonly

  @ref USBH_InitDeviceData() @n
   Populates device and endpoint data structures with data which must
   have been retrieved from a device by a call to
   @htmlonly USBH_QueryDeviceB() @endhtmlonly.
   The application must allocate and provide device and endpoint data
   structures to the host stack.
   After this function is called the device and endpoint data structures
   can be used as parameters (@em handles) to other API functions as needed.

 @n @subsection usb_host_print Utility functions

  @ref USBH_PrintString() @n
    Print an USB string descriptor on the debug serial port with optional leader
    and trailer strings.

  @ref USBH_PrintConfigurationDescriptor(),
  @ref USBH_PrintDeviceDescriptor(),
  @ref USBH_PrintEndpointDescriptor(),
  @ref USBH_PrintInterfaceDescriptor() @n
    Pretty print descriptors on the debug serial port.

  USB_PUTCHAR() @n Transmit a single char on the debug serial port.

  USB_PUTS() @n Transmit a zero terminated string on the debug serial port.

  USB_PRINTF() @n Transmit "printf" formated data on the debug serial port.

  USB_GetErrorMsgString() @n Return an error message string for a given
  error code.

  USB_PrintErrorMsgString() @n Format and print a text string given an
  error code, prepends an optional user supplied leader string.

  USBTIMER_DelayMs() @n Active wait millisecond delay function. Can also be
  used inside interrupt handlers.

  USBTIMER_DelayUs() @n Active wait microsecond delay function. Can also be
  used inside interrupt handlers.

  USBTIMER_Init() @n Initialize the timer system. Called by @htmlonly
  USBH_Init(), @endhtmlonly but your application must call it again to
  reinitialize whenever you change the HFPERCLK frequency.

  USBTIMER_Start() @n Start a timer. You can configure the USB device stack
  to provide any number of timers. The timers have 1 ms resolution, your
  application is notified of timeout by means of a callback.

  USBTIMER_Stop() @n Stop a timer.

@n @section usb_host_conf Configuring the host stack

 Your application must provide a header file named @em usbconfig.h. This file
 must contain the following \#define's:@n @n
 @verbatim
#define USB_HOST         // Compile the stack for host mode.
#define NUM_HC_USED n    // Your application use 'n' host channels in addition
                         // to channels 0 and 1 which are assigned by the
                         // host stack for device endpoint 0 communication. @endverbatim

 @n @em usbconfig.h may define the following items: @n @n
 @verbatim
#define NUM_APP_TIMERS n // Your application needs 'n' timers

#define DEBUG_USB_API    // Turn on API debug diagnostics.

// Some utility functions in the API needs printf. These
// functions have "print" in their name. This macro enables
// these functions.
#define USB_USE_PRINTF   // Enable utility print functions.

// Define a function for transmitting a single char on the serial port.
extern int RETARGET_WriteChar(char c);
#define USER_PUTCHAR  RETARGET_WriteChar

#define USB_TIMER USB_TIMERn  // Select which hardware timer the USB stack
                              // is allowed to use. Valid values are n=0,1,2...
                              // corresponding to TIMER0, TIMER1, ...
                              // If not specified, TIMER0 is used @endverbatim

 @n You are strongly encouraged to start application development with DEBUG_USB_API
 turned on. When DEBUG_USB_API is turned on and USER_PUTCHAR is defined, useful
 debugging information will be output on the development kit serial port.
 Compiling with the DEBUG_EFM_USER flag will also enable all asserts
 in both @em emlib and in the USB stack. If asserts are enabled and
 USER_PUTCHAR defined, assert texts will be output on the serial port.

 You application must include @em retargetserial.c if DEBUG_USB_API is defined
 and @em retargetio.c if USB_USE_PRINTF is defined.
 These files reside in the @em drivers
 directory in the software package for your development board.

 @n The host stack can be configured to monitor a GPIO input pin for detection
 of VBUS overcurrent or short circuit conditions. The stack will default to
 settings applicable to DK3750 for Classic Giant or SLSTK3701A for Giant 11.
 Override by using the following three \#define's:
 @n @n @verbatim
#define USB_VBUSOVRCUR_PORT       gpioPortB       // The port
#define USB_VBUSOVRCUR_PIN        7               // The pin number within the port
#define USB_VBUSOVRCUR_POLARITY   USB_VBUSOVRCUR_POLARITY_LOW @endverbatim

 Select any GPIO port for <b>USB_VBUSOVRCUR_PORT</b> or
 <b>USB_VBUSOVRCUR_PORT_NONE</b> if no overcurrent circuitry in the hw design.
 For <b>USB_VBUSOVRCUR_POLARITY</b> use <b>USB_VBUSOVRCUR_POLARITY_LOW</b>
 or <b>USB_VBUSOVRCUR_POLARITY_HIGH</b>.

 ***************************************************************************/

/** @} (end addtogroup usb_host) */
/** @} (end addtogroup usb) */

#endif /* defined( USB_HOST ) */
#endif /* defined( USB_PRESENT ) && ( USB_COUNT == 1 ) */
